InformationRegisters/ТокеныСинхронизацииGoogleAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТокеныСинхронизацииGoogleAPI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТокенОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЖизниТокенаAPI</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СекретныйКодКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСGoogleAPIВызовСервера/Ext/Module.bsl
Функция ПолучитьПараметрыАвторизации(ЭтоАвторизация = Ложь) Экспорт
	
	ПараметрыАвторизации = Константы.ДанныеАвторизацииGoogleAPI.Получить().Получить();
	
	Если НЕ ТипЗнч(ПараметрыАвторизации) = Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Дополняем параметры данными по ресурсам
	ПараметрыАвторизации.Вставить("СерверАвторизации", 		"accounts.google.com");
	ПараметрыАвторизации.Вставить("РесурсАвторизации", 		"/o/oauth2/token");
	ПараметрыАвторизации.Вставить("СерверGS", 				"www.googleapis.com");
	ПараметрыАвторизации.Вставить("РесурсGDrive", 			"/drive/v3/files");
	ПараметрыАвторизации.Вставить("РесурсЗагрузкиGDrive", 	"/upload/drive/v3/files");
	ПараметрыАвторизации.Вставить("РесурсTeamDrive", 		"/drive/v3/teamdrives");
	
	ЗаполнитьДействующиеТокены(ПараметрыАвторизации);
	
	Если НЕ ЭтоАвторизация И (ПустаяСтрока(ПараметрыАвторизации.ТокенОбновления) ИЛИ ПустаяСтрока(ПараметрыАвторизации.ТокенДоступа)) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПараметрыАвторизации;
	
КонецФункции

Функция СохранитьФайлНаДиск(ИмяСобытия, СтруктураФайла, ПараметрыПользователя, idРодителя = "", idФайлаGD = "") Экспорт 
	
	Возврат СохранитьФайлGoogleDrive_multipart(ИмяСобытия, СтруктураФайла, ПараметрыПользователя, idРодителя, idФайлаGD);
	
КонецФункции

Функция СоздатьПапкуНаДиске(ИмяСобытия, ИмяПапки, ПараметрыПользователя, idРодителя = "", idПапкиGD = "") Экспорт 
	
	Возврат СохранитьФайлGoogleDrive_multipart(ИмяСобытия, ИмяПапки, ПараметрыПользователя, idРодителя, idПапкиGD);
	
КонецФункции

Процедура ЗаполнитьДействующиеТокены(ПараметрыПользователя)
	
	ПараметрыПользователя.Вставить("ТокенОбновления", "");
	ПараметрыПользователя.Вставить("ТокенДоступа", "");
	ПараметрыПользователя.Вставить("ВремяЖизниТокенаAPI", Дата(1,1,1));
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТокеныСинхронизацииGoogleAPI.ТокенОбновления,
		|	ТокеныСинхронизацииGoogleAPI.ТокенДоступа,
		|	ТокеныСинхронизацииGoogleAPI.ВремяЖизниТокенаAPI
		|ИЗ
		|	РегистрСведений.ТокеныСинхронизацииGoogleAPI КАК ТокеныСинхронизацииGoogleAPI
		|ГДЕ
		|	ТокеныСинхронизацииGoogleAPI.ИдентификаторКлиента = &ИдентификаторКлиента
		|	И ТокеныСинхронизацииGoogleAPI.СекретныйКодКлиента = &СекретныйКодКлиента
		|";
	Запрос.УстановитьПараметр("ИдентификаторКлиента", ПараметрыПользователя.ИдентификаторКлиента);
	Запрос.УстановитьПараметр("СекретныйКодКлиента", ПараметрыПользователя.СекретныйКодКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПользователя, Выборка);
	КонецЕсли;
	
КонецПроцедуры

Функция СохранитьФайлGoogleDrive_multipart(ИмяСобытия, СтруктураФайла, ПараметрыПользователя, idРодителя = "", idФайлаПапкиGD = "") Экспорт
	
	СтруктураПараметров = ПодготовкаСоединенияПоAPI(ПараметрыПользователя, "СерверGS");
	Если СтруктураПараметров = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	Разделитель = "file_for_drive";
	
	ЭтоПапка = (ТипЗнч(СтруктураФайла) = Тип("Строка"));
	ТребуетсяДопРазделитель = Ложь;
	
	Если ЭтоПапка Тогда
		ИмяФайла = СтруктураФайла;
		ЗаголовокПоТипуФайла = "application/vnd.google-apps.folder";
	Иначе
		ИмяФайла = СтруктураФайла.ИмяФайла + "." + СтруктураФайла.Расширение;
		ЗаголовокПоТипуФайла = СоответствиеТипуФайлаЗаголовкамGoogle()[ВРег(СтруктураФайла.Расширение)];
		ТребуетсяДопРазделитель = ТребуетсяДопРазделитель(СтруктураФайла.Расширение);
	КонецЕсли;
	
	СтруктураПараметров.Заголовки.Вставить("Content-Type", "multipart/related; boundary=" + Разделитель);
		
	// Формируем описания содержимого: json с параметрами имя файла, заголовок и родитель
	Заголовки = Новый Массив;
	Заголовки.Добавить("Content-Type: application/json; charset=UTF-8");
	Заголовки.Добавить("Content-Disposition: form-data; name=""metadata""");
	ТелоЗапроса = СформироватьТелоЗапросаСозданиеФайлаGSs(ИмяФайла, ЗаголовокПоТипуФайла, idРодителя);
	ДвоичныеДанныеСообщения = СоздатьСообщение_ФайлТекст(Заголовки, ТелоЗапроса);
	
	Если Не ЭтоПапка Тогда
		// Формируем содержимое файла
		Заголовки.Очистить();
		Заголовки.Добавить("Content-Type: " + ЗаголовокПоТипуФайла);
		Заголовки.Добавить("uploadType: media");
		Заголовки.Добавить("Content-Disposition: form-data; name=""file""");
		ДвоичныеДанныеФайла = СоздатьСообщение_ФайлТекст(Заголовки, СтруктураФайла.Данные.Получить(), Истина);
	КонецЕсли;
	
	// Формируем основное составное сообщение.
	МассивСообщений = Новый Массив;
	МассивСообщений.Добавить(ДвоичныеДанныеСообщения);
	Если Не ЭтоПапка Тогда
		МассивСообщений.Добавить(ДвоичныеДанныеФайла);
	КонецЕсли;
	ДвоичныеДанныеТело = ПолучаемДвоичныеДанныеДляПакетныхСообщенийHTTP(Разделитель, МассивСообщений, ТребуетсяДопРазделитель);
	
	TeamDrives = "false";
	ЗапросHTTP = Новый HTTPЗапрос(СтрШаблон("%1?uploadType=multipart&supportsAllDrives=%2", СтруктураПараметров.РесурсЗагрузкиGDrive, TeamDrives), СтруктураПараметров.Заголовки); 
	
	ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанныеТело);
	
	Ответ = СтруктураПараметров.Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);
	
	Если Не Ответ.КодСостояния = 200 Тогда
		ТекстОшибки = СтрШаблон("Ошибка HTTP запроса %1, код ошибки %2", Ответ.ПолучитьТелоКакСтроку(), Ответ.КодСостояния);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросHTTP = Неопределено;
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());

	Фабрика = ПрочитатьJSON(Чтение);
	
    Чтение.Закрыть();
	
	Если Фабрика.Свойство("id") Тогда
		idФайлаПапкиGD = Фабрика.id;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СоответствиеТипуФайлаЗаголовкамGoogle()
	
	// ключи обязательно ЗАГЛАВНЫМИ буквами
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("XLSX", "application/vnd.ms-excel");
	Соответствие.Вставить("XLS", "application/vnd.ms-excel");
	Соответствие.Вставить("XLS95", "application/vnd.ms-excel");
	Соответствие.Вставить("XLS97", "application/vnd.ms-excel");
	Соответствие.Вставить("DOCX", "application/msword");
	Соответствие.Вставить("HTML", "text/html");
	Соответствие.Вставить("HTML3", "text/html");
	Соответствие.Вставить("HTML4", "text/html");
	Соответствие.Вставить("HTML5", "text/html");
	Соответствие.Вставить("ODS", "application/vnd.oasis.opendocument.spreadsheet");
	Соответствие.Вставить("PDF", "application/pdf");
	Соответствие.Вставить("JPG", "image/jpeg");
	Соответствие.Вставить("PNG", "image/png");
	Соответствие.Вставить("JPEG", "image/jpeg");
	Соответствие.Вставить("INI", "text/plain");
	Соответствие.Вставить("TXT", "text/plain");
	
	Возврат	Соответствие;
	
КонецФункции

Функция ТребуетсяДопРазделитель(Расширение)
	
	// Указаны расширения, по которым не нужно указывать доп. разделитель в теле запроса
	МассивРасширений = Новый Массив;
	МассивРасширений.Добавить("ini");
	МассивРасширений.Добавить("pdf");
	
	Возврат	(МассивРасширений.Найти(Расширение) = Неопределено);
	
КонецФункции

Функция ПодготовкаСоединенияПоAPI(ПараметрыПользователя, ИмяСервера = "") Экспорт 
	
	СтруктураПараметров = ПолучитьПараметрыАвторизации();
	
	Если СтруктураПараметров = Неопределено Тогда 
		
		ЗаписьЖурналаРегистрации("Интеграция с GS. Авторизация", УровеньЖурналаРегистрации.Ошибка,,, ТекстОбОшибкеСПараметрами());
		Возврат СтруктураПараметров;
		
	КонецЕсли;
	
	Если ТекущаяДатаСеанса() > ПараметрыПользователя.ВремяЖизниТокенаAPI Тогда 
		//обновляем токен
		ОбновитьТокены(ПараметрыПользователя, СтруктураПараметров);
	КонецЕсли;	
	
	//формируем запрос к gs
	Соединение = Новый HTTPСоединение(СтруктураПараметров[ИмяСервера], СтруктураПараметров.Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Authorization","Bearer " + ПараметрыПользователя.ТокенДоступа);
	
	СтруктураПараметров.Вставить("Заголовки", Заголовки);
	СтруктураПараметров.Вставить("Соединение", Соединение);
	
	Возврат СтруктураПараметров;
	
КонецФункции

Процедура ОбновитьТокены(ПараметрыПользователя, Знач ПараметрыСистемы) Экспорт
	
    СтрокаЗапроса = "grant_type=refresh_token" + "&";
    СтрокаЗапроса = СтрокаЗапроса + "client_id=" + ПараметрыПользователя.ИдентификаторКлиента + "&";
    СтрокаЗапроса = СтрокаЗапроса + "client_secret=" + ПараметрыПользователя.СекретныйКодКлиента + "&";
    СтрокаЗапроса = СтрокаЗапроса + "refresh_token=" + ПараметрыПользователя.ТокенОбновления;

	Соединение = Новый HTTPСоединение(ПараметрыСистемы.СерверАвторизации, ПараметрыСистемы.Порт,,,,, Новый ЗащищенноеСоединениеOpenSSL);

	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/x-www-form-urlencoded");
	
	ЗапросХТТП = Новый HTTPЗапрос(ПараметрыСистемы.РесурсАвторизации, Заголовки);
	ЗапросХТТП.УстановитьТелоИзСтроки(СтрокаЗапроса);

	Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросХТТП);
	
    Если Ответ.КодСостояния <> 200 Тогда Возврат КонецЕсли;

	Строка = Ответ.ПолучитьТелоКакСтроку();
	
    Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(Строка);

	Фабрика = ФабрикаXDTO.ПрочитатьJSON(Чтение);
	
    Чтение.Закрыть();
	
    ПараметрыПользователя.ТокенДоступа = Фабрика.access_token;
	ПараметрыПользователя.ВремяЖизниТокенаAPI = ТекущаяДата() + Число(Фабрика.expires_in) - 5; //так как есть небольшая задержка при проверки и создании/изменении учетки
	
	// Сохраняем новые данные авторизации в регистр
	МенеджерЗаписи = РегистрыСведений.ТокеныСинхронизацииGoogleAPI.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторКлиента = ПараметрыПользователя.ИдентификаторКлиента;
	МенеджерЗаписи.СекретныйКодКлиента = ПараметрыПользователя.СекретныйКодКлиента;
	
	Попытка
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.ТокенДоступа = ПараметрыПользователя.ТокенДоступа; 
		МенеджерЗаписи.ВремяЖизниТокенаAPI = ПараметрыПользователя.ВремяЖизниТокенаAPI;
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция ТекстОбОшибкеСПараметрами()
	Возврат "Не загружены параметры для работы с G Suite. Необходимо их заполнить в настройках программы ""Параметры подключения к Google API"".";
КонецФункции	

// Возвращает HTTP-сообщение в виде ДвоичныеДанные
//
// Параметры:
//  ЗаголовкиСообщения - массив строк - 
//  мДвоичныеДанные	 - ДвоичныеДанные - 
// 
// Возвращаемое значение:
//  ДвоичныеДанные - HTTP-сообщение
//
Функция СоздатьСообщение_ФайлТекст(ЗаголовкиСообщения, мДвоичныеДанные, ЭтоФайл = Ложь) Экспорт 
	
	Поток = Новый ПотокВПамяти();
	ЗаписьДанных = Новый ЗаписьДанных(Поток);
	
	// Заголовки.
	Для Каждого Стр Из ЗаголовкиСообщения Цикл 
		ЗаписьДанных.ЗаписатьСтроку(Стр);
	КонецЦикла;	
	ЗаписьДанных.ЗаписатьСтроку("");
	
	// Тело.
	Если ЭтоФайл Тогда
		ЗаписьДанных.Записать(мДвоичныеДанные);
	Иначе
		ЗаписьДанных.ЗаписатьСтроку(мДвоичныеДанные);
	КонецЕсли;
	
	ЗаписьДанных.Закрыть();
	
	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
КонецФункции

Функция ПолучаемДвоичныеДанныеДляПакетныхСообщенийHTTP(Разделитель, МассивДвоичныхДанных, ДопРазделитель) Экспорт 
	
	ПотокТело = Новый ПотокВПамяти();
	ЗаписьДанных = Новый ЗаписьДанных(ПотокТело);
	
	Для Каждого Стр Из МассивДвоичныхДанных Цикл 
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
		ЗаписьДанных.Записать(Стр);
	КонецЦикла;	
	
	Если ДопРазделитель Тогда
		ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель);
	КонецЕсли;
	ЗаписьДанных.ЗаписатьСтроку("--" + Разделитель + "--");

	ЗаписьДанных.Закрыть();
	
	Возврат ПотокТело.ЗакрытьИПолучитьДвоичныеДанные();
	
КонецФункции	

Функция СформироватьТелоЗапросаСозданиеФайлаGSs(ИмяФайла, mimeType, Родитель = "")
	
	ОбъектDrive = новый Структура;
	ОбъектDrive.Вставить("name", ИмяФайла);
	Если Не mimeType = Неопределено Тогда
		ОбъектDrive.Вставить("mimeType", mimeType);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Родитель) Тогда 
		
		МассивParents = новый Массив;
		МассивParents.Добавить(Родитель);
		
		ОбъектDrive.Вставить("parents", МассивParents);

	КонецЕсли;	
		
	ЗаписьJSON	= Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, ОбъектDrive);
	ТелоЗапросаJSON = ЗаписьJSON.Закрыть();
	
	Возврат ТелоЗапросаJSON;
	
КонецФункции

Процедура ЗаписьОшибкиПриРаботеСGS(ТекстОшибки, ДополнениеКИмениСобытия = "") Экспорт 
	
	ЗаписьЖурналаРегистрации(СтрШаблон("Интеграция с GS%1", ДополнениеКИмениСобытия), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);	
	#Если Клиент Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	#КонецЕсли
	
КонецПроцедуры

Функция ПолучитьФайлПоID(ID_файла) Экспорт 
	
	ПараметрыПользователя = ПолучитьПараметрыАвторизации();	
	
	Если ПараметрыПользователя = Неопределено Тогда
		Сообщить("Необходимо выполнить настройки авторизации Google API.");
	КонецЕсли;
	
	СтруктураПараметров = РаботаСGoogleAPIВызовСервера.ПодготовкаСоединенияПоAPI(ПараметрыПользователя, "СерверGS");
	Если СтруктураПараметров = Неопределено Тогда 
		PageToken = "";
		Возврат Неопределено;;
	КонецЕсли;	
	
	СтруктураПараметров.Заголовки.Вставить("Content-Type", "application/json");
	
	ЗапросHTTP = Новый HTTPЗапрос(СтрШаблон("%1/%2?alt=media", 
								СтруктураПараметров.РесурсGDrive,
								ID_файла), СтруктураПараметров.Заголовки);
	
	Ответ = СтруктураПараметров.Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	
	Если Не Ответ.КодСостояния = 200 Тогда
		ТекстОшибок = СтрШаблон("Ошибка HTTP запроса %1, код ошибки %2", Ответ.ПолучитьТелоКакСтроку(), Ответ.КодСостояния);
		РаботаСGoogleAPIВызовСервера.ЗаписьОшибкиПриРаботеСGS(ТекстОшибок, ". Получить папки");
		Возврат Неопределено;
	КонецЕсли;
	
	HTTPСоединение	= Неопределено;
	ЗапросHTTP		= Неопределено;
	
	Попытка
		ДанныеФайла = Ответ.ПолучитьТелоКакДвоичныеДанные();
	Исключение
		ДанныеФайла = Неопределено;
	КонецПопытки;

	Возврат ДанныеФайла;
	
КонецФункции

Функция ПолучитьПапкиИзДиска(ПараметрыПользователя, TeamDrive = Ложь, ID_Родителя = "", PageToken = "") Экспорт 
	
	СтруктураПараметров = РаботаСGoogleAPIВызовСервера.ПодготовкаСоединенияПоAPI(ПараметрыПользователя, "СерверGS");
	Если СтруктураПараметров = Неопределено Тогда 
		PageToken = "";
		Возврат Новый Массив;
	КонецЕсли;	
	
	СтруктураПараметров.Заголовки.Вставить("Content-Type", "application/json");
	
	Если TeamDrive И ID_Родителя = "" Тогда 
		СтрокаПодключения = СтрШаблон("%1?useDomainAdminAccess=false&orderBy=modifiedTime%2", 
								СтруктураПараметров.РесурсTeamDrive,
								?(PageToken = "", "", СтрШаблон("&pageToken=%1", PageToken)));
	Иначе 
		
		СтрокаПодключения = СтрШаблон("%1?q= mimeType = 'application/vnd.google-apps.folder' and '%2' in parents%3&orderBy=modifiedTime%4%5", 
								СтруктураПараметров.РесурсGDrive,
								?(ПустаяСтрока(ID_Родителя), "root", ID_Родителя),
								?(ПараметрыПользователя.Свойство("ПараметрОтбора"), ПараметрыПользователя.ПараметрОтбора, ""),
								?(TeamDrive, "&includeTeamDriveItems=true&supportsTeamDrives=true", ""),
								?(PageToken = "", "", СтрШаблон("&pageToken=%1", PageToken)));
	КонецЕсли;	
	
	ЗапросHTTP = Новый HTTPЗапрос(СтрокаПодключения, СтруктураПараметров.Заголовки);
	
	Ответ = СтруктураПараметров.Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	
	Если Не Ответ.КодСостояния = 200 Тогда
		PageToken = "";
		ТекстОшибок = СтрШаблон("Ошибка HTTP запроса %1, код ошибки %2", Ответ.ПолучитьТелоКакСтроку(), Ответ.КодСостояния);
		РаботаСGoogleAPIВызовСервера.ЗаписьОшибкиПриРаботеСGS(ТекстОшибок, ". Получить папки");
		Возврат Новый Массив;
	КонецЕсли;
	
	HTTPСоединение	= Неопределено;
	ЗапросHTTP		= Неопределено;
	
    Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());

	Фабрика = ПрочитатьJSON(Чтение);
	
    Чтение.Закрыть();
	
	//получить токен следующей страницы
	Если Фабрика.Свойство("nextPageToken") Тогда
		PageToken = Фабрика.nextPageToken;
	Иначе 
		PageToken = "";
	КонецЕсли;
	
	Если Фабрика.Свойство("files") Тогда
		Возврат Фабрика.files;
	ИначеЕсли Фабрика.Свойство("teamDrives") Тогда 
		Возврат Фабрика.teamDrives;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция АвторизацияВыполнена() Экспорт
	
	СтруктураПараметров = ПолучитьПараметрыАвторизации();
	
	Если СтруктураПараметров = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.Свойство("ТокенОбновления") Тогда
		Возврат Ложь;
	КонецЕсли;

	// https://developers.google.com/identity/protocols/oauth2?hl=ru
	// время жизни токена обновления по документации 6 месяцев
	Если ПустаяСтрока(СтруктураПараметров.ТокенОбновления) Или ПустаяСтрока(СтруктураПараметров.ТокенДоступа) Или СтруктураПараметров.ВремяЖизниТокенаAPI < ДобавитьМесяц(ТекущаяДатаСеанса(), -6) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СохранитьПараметрыАвторизации(РезультатЗакрытия, ПараметрыПользователя) Экспорт
	
	// Сохраняем данные авторизации в регистр
	МенеджерЗаписи = РегистрыСведений.ТокеныСинхронизацииGoogleAPI.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторКлиента = ПараметрыПользователя.ИдентификаторКлиента;
	МенеджерЗаписи.СекретныйКодКлиента = ПараметрыПользователя.СекретныйКодКлиента;
	
	Попытка
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.ИдентификаторКлиента = ПараметрыПользователя.ИдентификаторКлиента;
		МенеджерЗаписи.СекретныйКодКлиента = ПараметрыПользователя.СекретныйКодКлиента;
		МенеджерЗаписи.ТокенДоступа = РезультатЗакрытия.ТокенДоступа; 
		МенеджерЗаписи.ТокенОбновления = РезультатЗакрытия.ТокенОбновления;
		МенеджерЗаписи.ВремяЖизниТокенаAPI = РезультатЗакрытия.ВремяЖизниТокенаAPI;
		МенеджерЗаписи.Записать();
	Исключение
		Сообщить("Не удалось записать данные авторизации: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции
